Autodesk.Revit.DB.Plumbing.FluidTemperature.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Plumbing.FluidTemperature.Density
The density value
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidTemperature.Viscosity
The dynamic viscosity value
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidTemperature.Temperature
The temperature value
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidTemperature.#ctor(System.Double,System.Double,System.Double)
Creates a new fluid temperature with given temperature, dynamic viscosity and density.
temperature:
The temperature value.
viscosity:
The dynamic viscosity value.
density:
The density value.
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidTemperature
Represents the dynamic viscosity and density properties as defined at a certain temperature.
Since:
2013